Flow_Over_Heated_Plate_3D/Fluid-openfoam/0/T
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	T;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 0 0 1 0 0 0];
internalField	uniform 0;
boundaryField
{
	Coupling_Interface
	{
		type	fixedGradient;
		gradient	uniform 3000;
	}
	inlet
	{
		type	totalTemperature;
		T0	uniform 300;
		gamma	1.396;
	}
	outlet
	{
		type	inletOutlet;
		inletValue	uniform 300;
	}
	Fluid_Walls
	{
		type	zeroGradient;
	}
}
