Flow_Over_Heated_Plate_3D/Fluid-openfoam/0/U
FoamFile
{
	version	2.0;
	format	binary;
	class	volVectorField;
	location	"0";
	object	U;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 1 -1 0 0 0 0];
internalField	uniform (1 0 0);
boundaryField
{
	Coupling_Interface
	{
		type	noSlip;
	}
	inlet
	{
		type	fixedValue;
		value	uniform (1 0 0);
	}
	outlet
	{
		type	pressureInletOutletVelocity;
		value	uniform (1 0 0);
	}
	Fluid_Walls
	{
		type	noSlip;
	}
}
