Flow_Over_Heated_Plate_3D/Fluid-openfoam/0/k
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	k;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -2 0 0 0 0];
internalField	uniform 0.009999999776482582;
boundaryField
{
	Coupling_Interface
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
	inlet
	{
		type	turbulentIntensityKineticEnergyInlet;
		value	uniform 0.009999999776482582;
		intensity	0.05;
	}
	outlet
	{
		type	zeroGradient;
	}
	Fluid_Walls
	{
		type	kqRWallFunction;
		value	uniform 0.009999999776482582;
	}
}
