Flow_Over_Heated_Plate_3D/Fluid-openfoam/0/nut
FoamFile
{
	version	2.0;
	format	binary;
	class	volScalarField;
	location	"0";
	object	nut;
	arch	"LSB;label=32;scalar=64";
}
dimensions	[0 2 -1 0 0 0 0];
internalField	uniform 0.10000000149011612;
boundaryField
{
	Coupling_Interface
	{
		type	nutUWallFunction;
		value	uniform 0.10000000149011612;
	}
	inlet
	{
		type	calculated;
		value	uniform 0.10000000149011612;
	}
	outlet
	{
		type	calculated;
		value	uniform 0.10000000149011612;
	}
	Fluid_Walls
	{
		type	nutUWallFunction;
		value	uniform 0.10000000149011612;
	}
}
