Flow_Over_Heated_Plate_3D/Fluid-openfoam/Allmesh
#!/bin/sh
./Allclean
blockMesh
surfaceFeatureExtract
snappyHexMesh -overwrite
paraFoam
