Flow_Over_Heated_Plate_3D/Fluid-openfoam/system/blockMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

convertToMeters 1;

vertices
(
    (-5.150000100000001 -0.15000010000000044 2.3499999)
    (25.1500001 -0.15000010000000044 2.3499999)
    (25.1500001 2.6500001 2.3499999)
    (-5.150000100000001 2.6500001 2.3499999)
    (-5.150000100000001 -0.15000010000000044 5.150000100000001)
    (25.1500001 -0.15000010000000044 5.150000100000001)
    (25.1500001 2.6500001 5.150000100000001)
    (-5.150000100000001 2.6500001 5.150000100000001)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 10 10) simpleGrading (1 1 1)
);

defaultPatch
{
    type patch;
    faces
    (
        (0 1 5 4)
        (1 2 6 5)
        (2 3 7 6)
        (3 0 4 7)
        (0 3 2 1)
        (4 5 6 7)
    );
}

boundary
(
);

