Flow_Over_Heated_Plate_3D/Fluid-openfoam/system/fvOptions
FoamFile
{
	version	2.0;
	format	ascii;
	class	dictionary;
	location	"system";
	object	fvOptions;
}
temperatureLimit
{
	active	true;
	type	limitTemperature;
	limitTemperatureCoeffs
	{
		min	200;
		max	600;
		selectionMode	all;
	}
}
