Flow_Over_Heated_Plate_3D/Fluid-openfoam/system/snappyHexMeshDict

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}
castellatedMesh true;
snap            true;
addLayers       true;
geometry
{
    Fluid_Participant_Mesh.stl
    {
        type    triSurfaceMesh;
        name	Fluid_Participant_Mesh;
		regions
        {
        outlet
            {
                name    outlet;
            }
        Coupling_Interface
            {
                name    Coupling_Interface;
            }
        inlet
            {
                name    inlet;
            }
        Fluid_Walls
            {
                name    Fluid_Walls;
            }
        }
    }
    
}

castellatedMeshControls
{
    locationInMesh    (10 1.25 4);
    refinementSurfaces
    {
        Fluid_Participant_Mesh
        {
            level   (1 1);
            patchInfo
            {
                type wall;
            }
            regions
            {
                outlet
                {
                    level (1 1);
                    patchInfo
                    {
                        type patch;
                    }
                }
                Coupling_Interface
                {
                    level (2 3);
                    patchInfo
                    {
                        type wall;
                    }
                }
                inlet
                {
                    level (2 2);
                    patchInfo
                    {
                        type patch;
                    }
                }
                Fluid_Walls
                {
                    level (1 1);
                    patchInfo
                    {
                        type wall;
                    }
                }
            }
        }
    }
    refinementRegions
    {
        
    }
    limitRegions
    {
    }
    features    
    (
        {
            file    "Fluid_Participant_Mesh.eMesh";
            level    1;
        }
    );
    maxLocalCells   1000000;
    maxGlobalCells  10000000;
    nCellsBetweenLevels 4;
    maxLoadUnbalance    0.1;
    minRefinementCells  10;
    resolveFeatureAngle 45.0;
    allowFreeStandingZoneFaces  true;
}

snapControls
{
    tolerance   1.0;
    nSmoothPatch    3;
    nSolveIter  500;
    nRelaxIter  5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap true;
    //nFaceSplitInterval 5;
}

addLayersControls
{
    layers
    {
                Coupling_Interface
                    {
                        nSurfaceLayers      6;
                        expansionRatio      1.25;
                        firstLayerThickness 0.2;
                    }
                Fluid_Walls
                    {
                        nSurfaceLayers      3;
                        expansionRatio      1.25;
                        firstLayerThickness 0.2;
                    }
    }
    relativeSizes   true;
    minThickness    0.1;
    firstLayerThickness 0.2;
    expansionRatio  1.25;
    nGrow   0;
    featureAngle    130.0;
    maxFaceThicknessRatio 0.5;
    nSmoothSurfaceNormals 5;
    nSmoothThickness 10;
    minMedialAxisAngle 90.0;
    maxThicknessToMedialRatio 0.5;
    nMedialAxisIter 100;
    nSmoothNormals  3;
    slipFeatureAngle    30.0;
    nRelaxIter  5;
    nBufferCellsNoExtrude 0;
    nLayerIter  50;
    nRelaxedIter    20;
    detectExtrusionIsland true;
}

meshQualityControls
{
    maxNonOrtho 65.0;
    maxBoundarySkewness 20.0;
    maxInternalSkewness 4.0;
    maxConcave 80.0;
    minVol 1.0E-14;
    minTetQuality 1.0E-20;
    minArea -1.0;
    minTwist    0.02;
    minTriangleTwist -1.0;
    minDeterminant 0.01;
    minFaceWeight 0.05;
    minVolRatio 0.01;
    minVolCollapseRatio 0.1;
    nSmoothScale    4;
    errorReduction  0.75;
    relaxed
    {
        maxNonOrtho 75.0;
    }
}

mergeTolerance  1.0E-6;
debug   0;
